# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''
ip = input("Введите IP в формате: 10.1.1.0/24: ")
ip = ip.replace('.', ' ')
ip = ip.replace('/',' ')
ip = ip.split()
print("-" * 30)


print(f'''Network:\n{ip[0]:<8} {ip[1]:<8} {ip[2]:<8} {ip[3]:<8}''')
print(f'''{int(ip[0]):08b} {int(ip[1]):08b} {int(ip[2]):08b} {int(ip[3]):08b}''')

mask = [255, 255, 255 ,0]
print(f'''Mask:\n/{ip[4]}''')
print(f'''{mask[0]:<8} {mask[1]:<8} {mask[2]:<8} {mask[3]:<8}''')
print(f'''{int(mask[0]):08b} {int(mask[1]):08b} {int(mask[2]):08b} {int(mask[3]):08b}''')